[demisto_savedsearch_detail]
action.email.useNSSubject = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -2d@d
cron_schedule = 0 0 * * *
description = To load details of saved searches with demisto alert action
dispatch.earliest_time = -1d@d
dispatch.latest_time = now
search = index="_internal" sourcetype=scheduler status="success" | stats count by savedsearch_name, _time, result_count, suppressed

[Intrusion Detected - Demisto]
action.demisto = 1
action.demisto.param.details = Intrusion Detected by Splunk.
action.demisto.param.incident_name = Intrusion Detected on $result.src$
action.demisto.param.investigate = 0
action.demisto.param.labels = src:$result.src$,dest:$result.dest$,signature:$result.signature$,deviceType:$result.ids_type$,severity:$result.severity$
action.demisto.param.occured = $trigger_time$
action.demisto.param.severity = 3
action.demisto.param.type = Intrusion Detection
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
alert.digest_mode = False
alert.suppress = 1
alert.suppress.fields = src,dest
alert.suppress.period = 2h
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 * * * *
description = To create incident into Demisto for each Intrusion  detected.
dispatch.earliest_time = -1h
dispatch.latest_time = +5m
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = Splunk_DA-ESS_PCICompliance
request.ui_dispatch_view = search
search = tag=ids tag=attack | stats count by src,dest,signature,ids_type,severity
disabled = 1

[Vulnerability Detection -Demisto]
action.demisto = 1
action.demisto.param.details = Vulnerability found.
action.demisto.param.incident_name = Vulnerability detected from $result.dest$
action.demisto.param.labels = dest:$result.dest$,dest_category:$result.dest_category$,signature:$result.signature$,severity:$result.severity$,cvee:$result.cvee$,cvss:$result.cvss$
action.demisto.param.severity = 3
action.demisto.param.type = Vulnerability
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
alert.digest_mode = 0
alert.suppress = 1
alert.suppress.fields = dest,signature
alert.suppress.period = 3h
alert.track = 0
counttype = number of events
cron_schedule = 0 * * * *
description = To detect and report Vulnerability to Demisto
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = tag=vulnerability tag=report | stats count by dest,dest_category,signature,cve,severity,cvss
disabled = 1

[Malware Detection to Demisto]
action.demisto_alert = 1
action.demisto_alert.param.details = Malware detected on Splunk.
action.demisto_alert.param.incident_name = Malware Detected on src=$result.src$
action.demisto_alert.param.investigate = 1
action.demisto_alert.param.labels = src:$result.src$,dest:$result.dest$,signature:$result.signature$,category:$result.category$,
action.demisto_alert.param.severity = 4
action.demisto_alert.param.type = Malware
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
alert.digest_mode = 0
alert.suppress = 1
alert.suppress.fields = src,dest, signature
alert.suppress.period = 1h
alert.track = 0
counttype = number of events
cron_schedule = */60 * * * *
description = To log incident into Demisto once Malware is found
disabled = 1
dispatch.earliest_time = -60m
dispatch.latest_time = +5m
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = tag=malware tag=attack signature=* | stats count by src,dest,signature,category,action,vendor_product
